# Вычислить число c заданной точностью d. 
# Пример: при d = 0.001, π = 3.141
#         при d = 0.1, π = 3.1
#         при d = 0.00001, π = 3.14154
#         d от 0.1 до 0.0000000001

num = float(input("Введите число: "))
d = input("Задайте числу точность: ")

d = len(d[(d.find(".")+1):])
num = int(num*(10**(d+1)))
ost = num%10
num//=10
if ost>4:
    num +=1
num = num/10**d
print(f"Точное число: {num}")